nrfconnect/sdk-edge-ai/applications/gesture_recognition/src/nrf_edgeai_generated/nrf7120dk/Axon/nrf_edgeai_user_model.c
/* 2026-05-20T16:17:34.317124 */
/*
* Copyright (c) 2026 Nordic Semiconductor ASA
* SPDX-License-Identifier: Apache-2.0
*/
#include "nrf_edgeai_user_model.h"
#include "nrf_edgeai_user_types.h"
#include <nrf_edgeai/nrf_edgeai_platform.h>
#include <nrf_edgeai/rt/private/nrf_edgeai_interfaces.h>
#include <assert.h>

//////////////////////////////////////////////////////////////////////////////
/* Nordic EdgeAI Lab Solution ID and Runtime Version */
#define EDGEAI_LAB_SOLUTION_ID_STR      "36038"
#define EDGEAI_RUNTIME_VERSION_COMBINED 0x00000202

//////////////////////////////////////////////////////////////////////////////
#define INPUT_TYPE                         f32

/** User input features type */
#define INPUT_FEATURE_DATA_TYPE            NRF_EDGEAI_INPUT_F32

/** Number of unique features in the original input sample */
#define INPUT_UNIQ_FEATURES_NUM            6

/** Number of unique features actually used by NN from the original input sample */
#define INPUT_UNIQ_FEATURES_USED_NUM       6

/** Number of input feature samples that should be collected in the input window
 *  feature_sample = 1 * INPUT_UNIQ_FEATURES_NUM
 */
#define INPUT_WINDOW_SIZE                  99

/** Number of input feature samples on that the input window is shifted */
#define INPUT_WINDOW_SHIFT                 33

/** Number of subwindows in input feature window,
* the SUBWINDOW_SIZE = INPUT_WINDOW_SIZE / INPUT_SUBWINDOW_NUM
* if the window size is not divisible by the number of subwindows without a remainder,
* the remainder is added to the last subwindow size */
#define INPUT_SUBWINDOW_NUM                 0

#define INPUT_UNIQUE_SCALES_NUM (sizeof(INPUT_FEATURES_SCALE_MIN) / sizeof(INPUT_FEATURES_SCALE_MIN[0]))

/** Defines input(also used for LAG) features MIN scaling factor
 */
static const nrf_user_input_t INPUT_FEATURES_SCALE_MIN[] = {
 -32748.0000000, -32730.0000000, -32765.0000000, -17453.0000000,
 -17453.0000000, -17453.0000000 };

/** Defines input(also used for LAG) features MAX scaling factor
 */
static const nrf_user_input_t INPUT_FEATURES_SCALE_MAX[] = {
 32754.0000000, 32726.0000000, 32765.0000000, 16426.0000000, 17453.0000000,
 17453.0000000 };

/** Defines which unique features from the input data will be used/collected,
 *  one bit for one unique feature, starting from LSB
 */
#define INPUT_FEATURES_USAGE_MASK NULL

/** Defines which unique input features is used for LAG features processing,
 *  one bit for one unique feature, starting from LSB
 */
#define INPUT_FEATURES_USED_FOR_LAGS_MASK NULL

//////////////////////////////////////////////////////////////////////////////
#define MODEL_TYPE                 __NRF_EDGEAI_MODEL_AXON
#define MODEL_TASK                 0
#define MODEL_OUTPUTS_NUM          8

#define MODEL_USES_AS_INPUT_INPUT_FEATURES 0
#define MODEL_USES_AS_INPUT_DSP_FEATURES 1
#define MODEL_USES_AS_INPUT_MASK ((MODEL_USES_AS_INPUT_INPUT_FEATURES << 0) | (MODEL_USES_AS_INPUT_DSP_FEATURES << 1))

#if MODEL_TYPE == __NRF_EDGEAI_MODEL_AXON
#include <drivers/axon/nrf_axon_nn_infer.h>
#include <axon/nrf_axon_platform.h>
#include "nrf_edgeai_user_model_axon.h"
#define P_MODEL_INSTANCE &model_axon_user_instance_36038
#else  // MODEL_TYPE == __NRF_EDGEAI_MODEL_NEUTON
#define P_MODEL_INSTANCE &model_neuton_user_instance_
#endif


#define NN_DECODED_OUTPUT_INIT                 \
.classif = {                                   \
   .predicted_class = 0,                       \
   .num_classes = MODEL_OUTPUTS_NUM,           \
}

//////////////////////////////////////////////////////////////////////////////
/** Input feature buffer element size,
 * if quantization of model is bigger than input features size in bits,
 * the size of input buffer should aligned to nrf_user_neuron_t */
#define INPUT_TYPE_SIZE \
    ((sizeof(nrf_user_input_t) > sizeof(nrf_user_neuron_t)) ? sizeof(nrf_user_input_t) : sizeof(nrf_user_neuron_t))

/** Input features window size in bytes to allocate statically */
#define INPUT_WINDOW_BUFFER_SIZE_BYTES \
    (INPUT_WINDOW_SIZE * INPUT_UNIQ_FEATURES_NUM * INPUT_TYPE_SIZE)

static uint8_t input_window_[INPUT_WINDOW_BUFFER_SIZE_BYTES] __NRF_EDGEAI_ALIGNED;

#define INPUT_WINDOW_MEMORY    &input_window_[0]

static nrf_edgeai_window_ctx_t input_window_ctx_;
#define P_INPUT_WINDOW_CTX     &input_window_ctx_

//////////////////////////////////////////////////////////////////////////////
/** The maximum number of extracted features that user used for all unique input features */
#define EXTRACTED_FEATURES_NUM  96

#define EXTRACTED_FEATURES_META_TYPE f32

/** DSP feature buffer element size,
 * if quantization of model is bigger than DSP features size in bits,
 * the size of extracted DSP features buffer should aligned to nrf_user_neuron_t */
#define EXTRACTED_FEATURE_SIZE_BYTES                                                  \
    ((sizeof(nrf_user_feature_t) > sizeof(nrf_user_neuron_t)) ? sizeof(nrf_user_feature_t) : \
                                                            sizeof(nrf_user_neuron_t))

/** Size of extracted features buffer in bytes */
#define EXTRACTED_FEATURES_BUFFER_SIZE_BYTES (EXTRACTED_FEATURES_NUM * EXTRACTED_FEATURE_SIZE_BYTES)

/** Defines feature extraction masks used as nrf_edgeai_features_mask_t,
 *  64 bit for one unique input feature, @ref nrf_edgeai_features_mask_t to see bitmask
 */

static const uint64_t FEATURES_EXTRACTION_MASK[] = {
 0x5fc79b00000000, 0x5fc79b00000000, 0x5fc79b00000000, 0x5fc79b00000000,
 0x5fc79b00000000, 0x5fc79b00000000 };

/** Defines arguments used while feature extraction
 */

/** Defines arguments used while feature extraction
 */
static const nrf_user_input_t FEATURES_EXTRACTION_ARGUMENTS[] =
{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 };

/** Defines extracted features MIN scaling factor
 */
static const nrf_user_feature_t EXTRACTED_FEATURES_SCALE_MIN[] = {
 -32748.0000000, -7267.0000000, -9425.1816406, 40.9948006, 47.1917114,
 70.2703323, 0.0102041, 0.0000000, 59.6161613, 20.6530609, 0.0000000,
 0.0000000, 0.0000000, 0.1212121, 0.0000000, 255.6501465, -32730.0000000,
 -7666.0000000, -13897.9794922, 29.5414734, 35.4567223, 49.7439919,
 0.0102041, 0.0000000, 40.9494934, 18.1530609, 0.0000000, 0.0000000,
 0.0000000, 0.1717172, 0.0000000, 235.5228271, -32765.0000000,
 -284.0000000, -7485.1718750, 47.0745850, 61.5536728, 529.1563110,
 0.0102041, 0.0000000, 434.9090881, 27.3775501, 0.0000000, 0.0000000,
 0.0000000, 0.1313131, 0.0000000, 343.0218506, -17453.0000000, 10.0000000,
 -2865.6667480, 4.9696970, 6.3197622, 7.3663173, 0.0102041, 0.0000000,
 5.4949493, 2.1734693, 0.0000000, 0.0000000, 0.0101010, 0.1414141,
 0.0000000, 27.4043789, -17453.0000000, -3494.0000000, -8439.6367188,
 4.4832158, 5.9640450, 6.1627750, 0.0102041, 0.0000000, 4.4646463,
 2.8265307, 0.0000000, 0.0000000, 0.0000000, 0.1616162, 0.0000000,
 35.5949440, -17453.0000000, -483.0000000, -4905.6567383, 5.8536901,
 7.6901665, 7.8380065, 0.0102041, 0.0000000, 5.9191918, 3.0612245,
 0.0000000, 0.0000000, 0.0000000, 0.1313131, 0.0000000, 39.7114601 };

/** Defines extracted features MAX scaling factor
 */
static const nrf_user_feature_t EXTRACTED_FEATURES_SCALE_MAX[] = {
 4885.0000000, 32754.0000000, 11374.7773438, 15412.7685547, 18479.0859375,
 19096.8144531, 0.3265306, 0.3061225, 16738.8691406, 8404.6328125,
 0.1734694, 0.1734694, 1.0000000, 0.8383839, 0.3131313, 171357.0937500,
 6514.0000000, 32726.0000000, 9336.1513672, 23603.1230469, 24653.2363281,
 24755.1835938, 0.3775510, 0.3775510, 23726.2929688, 18015.8984375,
 0.2346939, 0.2346939, 1.0000000, 0.8585858, 0.3232323, 271293.2812500,
 9803.0000000, 32765.0000000, 13463.3330078, 18790.7519531, 21102.3886719,
 21262.4101562, 0.3877551, 0.3061225, 18878.5957031, 14207.1630859,
 0.2448980, 0.2448980, 1.0000000, 0.8787879, 0.2828283, 228357.3437500,
 597.0000000, 16426.0000000, 6722.4443359, 7007.6567383, 8455.8876953,
 8931.9335938, 0.2448980, 0.2551020, 8321.4951172, 1701.4693604, 0.1632653,
 0.1632653, 1.0000000, 0.9090909, 0.3232323, 31512.7421875, 407.0000000,
 17453.0000000, 3480.9494629, 10450.7490234, 11906.0722656, 11949.7958984,
 0.3469388, 0.3469388, 10639.8994141, 3293.6735840, 0.2448980, 0.2448980,
 1.0000000, 0.8888889, 0.3030303, 47526.9023438, 544.0000000,
 17453.0000000, 3967.0808105, 10020.2080078, 11040.5839844, 11054.3789062,
 0.2551020, 0.2551020, 10048.0908203, 4000.2448730, 0.1734694, 0.1734694,
 1.0000000, 0.8686869, 0.3131313, 47814.7812500 };

/** Memory allocation to store extracted features during DSP pipeline */
static uint8_t extracted_features_buffer_[EXTRACTED_FEATURES_BUFFER_SIZE_BYTES] __NRF_EDGEAI_ALIGNED;


/** Timedomain features processing context  */
#define P_TIMEDOMAIN_FEATURES_CTX  NULL
/** Timedomain features in feature extraction pipeline  */
static const nrf_edgeai_features_pipeline_func_f32_t timedomain_features_[] = {
    nrf_edgeai_feature_utility_tss_sum_f32,
    nrf_edgeai_feature_min_max_range_f32,
    nrf_edgeai_feature_mean_f32,
    nrf_edgeai_feature_mad_f32,
    nrf_edgeai_feature_std_f32,
    nrf_edgeai_feature_rms_f32,
    nrf_edgeai_feature_mcr_f32,
    nrf_edgeai_feature_zcr_f32,
    nrf_edgeai_feature_absmean_f32,
    nrf_edgeai_feature_amdf_f32,
    nrf_edgeai_feature_pscr_f32,
    nrf_edgeai_feature_nscr_f32,
    nrf_edgeai_feature_psoz_f32,
    nrf_edgeai_feature_psom_f32,
    nrf_edgeai_feature_psos_f32,
    nrf_edgeai_feature_rmds_f32
 };

static const nrf_edgeai_features_pipeline_ctx_t timedomain_pipeline_ = {
    .functions_num     = sizeof(timedomain_features_) / sizeof(timedomain_features_[0]),
    .functions.p_void  = timedomain_features_,
    .p_ctx             = P_TIMEDOMAIN_FEATURES_CTX,
};
#define P_TIMEDOMAIN_PIPELINE &timedomain_pipeline_

#define P_FREQDOMAIN_PIPELINE NULL

#define P_CUSTOMDOMAIN_PIPELINE NULL

static nrf_edgeai_dsp_pipeline_t dsp_pipeline_ = {
   .features = {
       .p_masks = (const nrf_edgeai_features_mask_t*)FEATURES_EXTRACTION_MASK,
       .buffer.p_void = extracted_features_buffer_,
       .overall_num = EXTRACTED_FEATURES_NUM,
       .masks_num = sizeof(FEATURES_EXTRACTION_MASK) / sizeof(FEATURES_EXTRACTION_MASK[0]),

       .p_timedomain_pipeline = P_TIMEDOMAIN_PIPELINE,
       .p_freqdomain_pipeline = P_FREQDOMAIN_PIPELINE,
       .p_customdomain_pipeline = P_CUSTOMDOMAIN_PIPELINE,

       .meta.EXTRACTED_FEATURES_META_TYPE = {
           .p_min = EXTRACTED_FEATURES_SCALE_MIN,
           .p_max = EXTRACTED_FEATURES_SCALE_MAX,
       .p_arguments = FEATURES_EXTRACTION_ARGUMENTS,
       },
   },
};

#define P_DSP_PIPELINE         &dsp_pipeline_


//////////////////////////////////////////////////////////////////////////////
#define NN_INPUT_INIT_INTERFACE        nrf_edgeai_input_init_sliding_window
#define NN_INPUT_FEED_INTERFACE        nrf_edgeai_input_feed_sliding_window_f32
#define NN_PROCESS_FEATURES_INTERFACE  nrf_edgeai_process_features_dsp_f32_f32
#define NN_INIT_INFERENCE_INTERFACE    nrf_edgeai_init_inference_axon
#define NN_RUN_INFERENCE_INTERFACE     nrf_edgeai_run_inference_axon
#define NN_PROPAGATE_OUTPUTS_INTERFACE nrf_edgeai_output_dequantize_axon_q8_f32
#define NN_DECODE_OUTPUTS_INTERFACE    nrf_edgeai_output_decode_classification_f32

//////////////////////////////////////////////////////////////////////////////

static nrf_user_output_t model_outputs_[MODEL_OUTPUTS_NUM];

//////////////////////////////////////////////////////////////////////////////

static nrf_edgeai_t nrf_edgeai_ = {
    ///
    .metadata.p_solution_id     = EDGEAI_LAB_SOLUTION_ID_STR,
    .metadata.version.combined  = EDGEAI_RUNTIME_VERSION_COMBINED,
    ///
    .input.p_used_for_lags_mask = INPUT_FEATURES_USED_FOR_LAGS_MASK,
    .input.p_usage_mask         = INPUT_FEATURES_USAGE_MASK,
    .input.type                 = INPUT_FEATURE_DATA_TYPE,
    .input.unique_num           = INPUT_UNIQ_FEATURES_NUM,
    .input.unique_num_used      = INPUT_UNIQ_FEATURES_USED_NUM,
    .input.unique_scales_num    = INPUT_UNIQUE_SCALES_NUM,
    .input.window_size          = INPUT_WINDOW_SIZE,
    .input.window_shift         = INPUT_WINDOW_SHIFT,
    .input.subwindow_num        = INPUT_SUBWINDOW_NUM,
    .input.window_memory.p_void = INPUT_WINDOW_MEMORY,
    .input.p_window_ctx         = P_INPUT_WINDOW_CTX,

    .input.scale.INPUT_TYPE = {
        .p_min = INPUT_FEATURES_SCALE_MIN,
        .p_max = INPUT_FEATURES_SCALE_MAX,
    },
    ///
    .p_dsp = P_DSP_PIPELINE,
    ///
    .model.type                 = (nrf_edgeai_model_type_t)MODEL_TYPE,
    .model.task                 = (nrf_edgeai_model_task_t)MODEL_TASK,
    .model.instance.p_void      = P_MODEL_INSTANCE,
    .model.output.memory.p_void = model_outputs_,
    .model.output.num           = MODEL_OUTPUTS_NUM,
    .model.uses_as_input.all    = MODEL_USES_AS_INPUT_MASK,
    ///
    .interfaces.input_init          = NN_INPUT_INIT_INTERFACE,
    .interfaces.feed_inputs         = NN_INPUT_FEED_INTERFACE,
    .interfaces.process_features    = NN_PROCESS_FEATURES_INTERFACE,
    .interfaces.init_inference      = NN_INIT_INFERENCE_INTERFACE,
    .interfaces.run_inference       = NN_RUN_INFERENCE_INTERFACE,
    .interfaces.propagate_outputs   = NN_PROPAGATE_OUTPUTS_INTERFACE,
    .interfaces.decode_outputs      = NN_DECODE_OUTPUTS_INTERFACE,
    ///
    .decoded_output = { NN_DECODED_OUTPUT_INIT },
};

//////////////////////////////////////////////////////////////////////////////

nrf_edgeai_t* nrf_edgeai_user_model_36038(void)
{
    return &nrf_edgeai_;
}

//////////////////////////////////////////////////////////////////////////////

uint32_t nrf_edgeai_user_model_neuton_size_36038(void)
{
    uint32_t model_meta_size = 0;
#if MODEL_TYPE == __NRF_EDGEAI_MODEL_NEUTON
    model_meta_size +=
        (sizeof(MODEL_WEIGHTS) + sizeof(MODEL_NEURONS_LINKS) +
         sizeof(MODEL_NEURON_EXTERNAL_LINKS_NUM) + sizeof(MODEL_NEURON_INTERNAL_LINKS_NUM) +
         sizeof(MODEL_NEURON_ACTIVATION_WEIGHTS) + sizeof(MODEL_NEURON_ACTIVATION_TYPE_MASK) +
         sizeof(MODEL_OUTPUT_NEURONS_INDICES));
#endif

#if MODEL_TASK == __NRF_EDGEAI_TASK_ANOMALY_DETECTION
    model_meta_size += sizeof(MODEL_AVERAGE_EMBEDDING) + sizeof(MODEL_OUTPUT_SCALE_MIN) +
                       sizeof(MODEL_OUTPUT_SCALE_MAX);
#endif

#if MODEL_TASK == __NRF_EDGEAI_TASK_REGRESSION
    model_meta_size += sizeof(MODEL_OUTPUT_SCALE_MIN) + sizeof(MODEL_OUTPUT_SCALE_MAX);
#endif

    return model_meta_size;
}
